Repository: ParanthamanCodeSpace/TechM-Training
Catalog: Flutter_Project/gov_*/lib/l10n/app_*.arb
Languages: ta

# appTitle
source: Gov ID Card Generator
ta: அரசு அடையாள அட்டை உருவாக்கி

# register
source: Register for ID Card
ta: அடையாள அட்டைக்காக பதிவு செய்யவும்

# viewUsers
source: View Registered Users
ta: பதிவு செய்யப்பட்ட பயனர்களைப் பார்க்கவும்

source: Full Name
ta: முழு பெயர்

# dob
source: Date of Birth
ta: பிறந்த தேதி

source: Address
ta: முகவரி

# registerSuccess
source: User Registered Successfully!
ta: பயனர் வெற்றிகரமாக பதிவு செய்யப்பட்டது!

source: Password
ta: கடவுச்சொல்

source: Email
ta: மின்னஞ்சல்

# noUsers
source: No registered users found.
ta: பதிவு செய்யப்பட்ட பயனர்கள் எதுவும் இல்லை.

# invalidEmail
source: Invalid email format!
ta: தவறான மின்னஞ்சல் வடிவம்!

# weakPassword
source: Password is too weak!
ta: கடவுச்சொல் மிகவும் பலவீனமானது!

source: Login
ta: உள்நுழையவும்

# fillAllFields
source: Please fill all fields!
ta: அனைத்து புலங்களையும் பூர்த்தி செய்யவும்!

# registerFailed
source: registartion failed
ta: பதிவு செய்யப்பட்டது!
